app/controllers/sessions_controller.rb

  def create
    self.current_user = User.authenticate(params[:login], params[:password])
    if logged_in?
      if params[:remember_me] == "1"
        current_user.remember_me unless current_user.remember_token?
        cookies[:auth_token] = { :value => self.current_user.remember_token , :expires => self.current_user.remember_token_expires_at }
      end
      flash[:notice] = "Logged in successfully"
      if current_user.clients.length == 0
---
SELECT * FROM `users` WHERE (login = 'matt' and activated_at IS NOT NULL) LIMIT 1
SELECT `clients`.* FROM `clients` INNER JOIN `client_users` ON `clients`.id = `client_users`.client_id WHERE ((`client_users`.user_id = 953125641))